Revit 2024 API
ViewDisplayBackgroundImageFlags Enumeration
 A collection of bit flags that control how the background image is positioned in relation to the crop region (or the view boundary).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum ViewDisplayBackgroundImageFlags
Visual Basic
Public Enumeration ViewDisplayBackgroundImageFlags
Visual C++
public enum class ViewDisplayBackgroundImageFlags
Members
Member name | Description
None |  The image is displayed pixel-to-pixel
FitToScreen |  The image is stretched in both directions
FixedAspectRatio |  The image is stretched but the ratio of its height to width is preserved.
UseTiling |  The pixels of the background are filled by tiling of the image.
See Also
Autodesk.Revit.DB Namespace